{
    "title": "FeiHua Anti-Virus",
    "link": "https://github.com/nthnn/Feihua",
    "content": "<p>Feihua is a lightweight anti-virus and anti-malware program designed for Windows systems. It verifies file hashes against the VirusShare.com database, helping users detect known malware and viruses based on their unique identifiers.</p><p>Feihua &quot;廢話&quot; (pinyin: /fèi-huà/) translates closely to &quot;nonsense.&quot;</p><br class=\"mobile-only\"/><center><a href=\"/images/projects/project_46_01.png\"><img src=\"/images/projects/project_46_01.png\" class=\"col-12 col-lg-5\" /></a></center><br/><h3 class=\"shimmer\">Features</h3><hr/><ul><li><i>Hash Verification</i> &mdash; Feihua compares file hashes against a local database sourced from VirusShare.com.</li><li><i>Lightweight</i> &mdash; Designed to be resource-efficient and run smoothly on Windows systems.</li><li><i>Simple Interface</i> User-friendly interface for easy hash checking and malware detection.</li></ul><br/><h3 class=\"shimmer\">Installation</h3><hr/><ol><li><b>Installation:</b><ul><li>Download the latest <a href=\"https://github.com/nthnn/Feihua/releases\" class=\"text-decoration-none text-info\" target=\"_blank\">release</a> from the releases page.</li><li>Extract the downloaded zip file to a preferred location on your Windows machine.</li></ul></li><li><b>Running Feihua:</b><ul><li>Click the <kbd>Update Database</kbd> button on first use or if you have no <kbd>hashes.sqlite3</kbd> on the extraction folder. This may take a while to finish depending on your network connection strength. Alternatively, you can download a pre-fetched <kbd>hashes.sqlite3</kbd> database from the releases.</li><li>Use the interface to select a file and check its hash against the VirusShare.com database with the <kbd>Scan File(s)</kbd> button.</li></ul></li><li><b>Verifying Files:</b><ul><li>Select a file using the browse button.</li><li>Feihua will calculate the hash of the selected file and compare it against the local database.</li><li>If a match is found, Feihua will alert you about the file's status based on VirusShare.com data.</li></ul></li></ol>"
}